Revit 2024 API
HorizontalCurveEndpoint Members
The HorizontalCurveEndpoint type exposes the following members.
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
NextCurveType
 The HorizontalCurveType of the curve which connects the endpoint to the next displayed curve. If this endpoint's Station equals DisplayedEndStation, returns Unknown curve type.
PreviousCurveType
 The HorizontalCurveType of the curve which connects the endpoint to the previous displayed curve. If this endpoint's Station equals DisplayedStartStation, returns Unknown curve type.
Station
 The endpoint's station value.
See Also
HorizontalCurveEndpoint Class
Autodesk.Revit.DB.Infrastructure Namespace